import {DataType} from './DataType';

const data: DataType = {
  chapterNo: 1,
  chapterName: 'Al-Fatihah',
  chapterNameTranslate: {
    id: 'Pembuka',
  },
  lastVerseNo: 7,
  verses: {
    1: {
      helper: 'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ',
      full: 'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ',
    },
    2: {
      helper: 'اَلْحَمْدُ لِلّٰ',
      full: 'اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَۙ',
    },
    3: {
      helper: 'الرَّحْمٰنِ',
      full: 'الرَّحْمٰنِ الرَّحِيْمِۙ',
    },
    4: {
      helper: 'مٰلِكِ',
      full: 'مٰلِكِ يَوْمِ الدِّيْنِۗ',
    },
    5: {
      helper: 'اِيَّاكَ',
      full: 'اِيَّاكَ نَعْبُدُ وَاِيَّاكَ نَسْتَعِيْنُۗ',
    },
    6: {
      helper: 'اِهْدِنَا',
      full: 'اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ۙ',
    },
    7: {
      helper: 'صِرَاطَ الَّذِيْنَ',
      full:
        'صِرَاطَ الَّذِيْنَ اَنْعَمْتَ عَلَيْهِمْ ەۙ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّاۤلِّيْنَ',
    },
  },
};

export default data;
