import {DataType} from './DataType';

const data: DataType = {
  chapterNo: 2,
  chapterName: 'Al-Baqarah',
  chapterNameTranslate: {
    id: 'Sapi Betina',
  },
  lastVerseNo: 286,
  verses: {
    1: {
      helper: 'الۤمّۤ ۚ',
      full: 'الۤمّۤ ۚ',
    },
    2: {
      helper: 'ذٰلِكَ',
      full: 'ذٰلِكَ الْكِتٰبُ لَا رَيْبَ ۛ فِيْهِ ۛ هُدًى لِّلْمُتَّقِيْنَۙ',
    },
    3: {
      helper: 'الَّذِيْنَ',
      full:
        'الَّذِيْنَ يُؤْمِنُوْنَ بِالْغَيْبِ وَيُقِيْمُوْنَ الصَّلٰوةَ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ ۙ',
    },
    4: {
      helper: 'وَالَّذِيْنَ',
      full:
        'وَالَّذِيْنَ يُؤْمِنُوْنَ بِمَآ اُنْزِلَ اِلَيْكَ وَمَآ اُنْزِلَ مِنْ قَبْلِكَ ۚ وَبِالْاٰخِرَةِ هُمْ يُوْقِنُوْنَۗ',
    },
    5: {
      helper: 'اُولٰۤىِٕكَ',
      full:
        'اُولٰۤىِٕكَ عَلٰى هُدًى مِّنْ رَّبِّهِمْ ۙ وَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ',
    },
    6: {
      helper: 'اِنَّ الَّذِيْنَ',
      full:
        'اِنَّ الَّذِيْنَ كَفَرُوْا سَوَاۤءٌ عَلَيْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُوْنَ',
    },
    7: {
      helper: 'خَتَمَ اللّٰهُ',
      full:
        'خَتَمَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَعَلٰى سَمْعِهِمْ ۗ وَعَلٰٓى اَبْصَارِهِمْ غِشَاوَةٌ وَّلَهُمْ عَذَابٌ عَظِيْمٌ',
    },
    8: {
      helper: 'وَمِنَ النَّاسِ',
      full:
        'وَمِنَ النَّاسِ مَنْ يَّقُوْلُ اٰمَنَّا بِاللّٰهِ وَبِالْيَوْمِ الْاٰخِرِ وَمَا هُمْ بِمُؤْمِنِيْنَۘ',
    },
    9: {
      helper: 'يُخٰدِعُوْنَ',
      full:
        'يُخٰدِعُوْنَ اللّٰهَ وَالَّذِيْنَ اٰمَنُوْا ۚ وَمَا يَخْدَعُوْنَ اِلَّآ اَنْفُسَهُمْ وَمَا يَشْعُرُوْنَۗ',
    },
  },
};

export default data;
