import {DataType} from './DataType';

const data: DataType = {
  chapterNo: 78,
  chapterName: "An-Naba'",
  chapterNameTranslate: {
    id: 'Berita Besar',
  },
  lastVerseNo: 40,
  verses: {
    1: {
      helper: 'عَمَّ',
      full: 'عَمَّ يَتَسَاۤءَلُوْنَۚ',
    },
    2: {
      helper: 'عَنِ',
      full: 'عَنِ النَّبَاِ الْعَظِيْمِۙ',
    },
    3: {
      helper: 'الَّذِيْ',
      full: 'الَّذِيْ هُمْ فِيْهِ مُخْتَلِفُوْنَۗ',
    },
    // 4: {
    //   full: 'كَلَّا سَيَعْلَمُوْنَۙ',
    // },
    // 5: {
    //   full: 'ثُمَّ كَلَّا سَيَعْلَمُوْنَ',
    // },
    // 6: {
    //   full: 'اَلَمْ نَجْعَلِ الْاَرْضَ مِهٰدًاۙ',
    // },
    // 7: {
    //   full: 'وَّالْجِبَالَ اَوْتَادًاۖ',
    // },
    // 8: {
    //   full: 'وَّخَلَقْنٰكُمْ اَزْوَاجًاۙ',
    // },
    // 9: {
    //   full: 'وَّجَعَلْنَا نَوْمَكُمْ سُبَاتًاۙ',
    // },
    // 10: {
    //   full: 'وَّجَعَلْنَا الَّيْلَ لِبَاسًاۙ',
    // },
    // 11: {
    //   full: 'وَّجَعَلْنَا النَّهَارَ مَعَاشًاۚ',
    // },
    // 12: {
    //   full: 'وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًاۙ',
    // },
    // 13: {
    //   full: 'وَّجَعَلْنَا سِرَاجًا وَّهَّاجًاۖ',
    // },
    // 14: {
    //   full: 'وَّاَنْزَلْنَا مِنَ الْمُعْصِرٰتِ مَاۤءً ثَجَّاجًاۙ',
    // },
    // 15: {
    //   full: 'لِّنُخْرِجَ بِهٖ حَبًّا وَّنَبَاتًاۙ',
    // },
    // 16: {
    //   full: 'وَّجَنّٰتٍ اَلْفَافًاۗ',
    // },
    // 17: {
    //   full: 'اِنَّ يَوْمَ الْفَصْلِ كَانَ مِيْقَاتًاۙ',
    // },
    // 18: {
    //   full: 'يَّوْمَ يُنْفَخُ فِى الصُّوْرِ فَتَأْتُوْنَ اَفْوَاجًاۙ',
    // },
    // 19: {
    //   full: 'وَّفُتِحَتِ السَّمَاۤءُ فَكَانَتْ اَبْوَابًاۙ',
    // },
    // 20: {
    //   full: 'وَّسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًاۗ',
    // },
    // 21: {
    //   full: 'اِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًاۙ',
    // },
  },
};

export default data;
