import {DataType} from './DataType';

const data: DataType = {
  chapterNo: 78,
  chapterName: "An-Naba'",
  chapterNameTranslate: {
    id: 'Berita Besar',
  },
  lastVerseNo: 40,
  verses: {
    1: {
      helper: 'عَمَّ',
      full: 'عَمَّ يَتَسَاۤءَلُوْنَۚ',
    },
    2: {
      helper: 'عَنِ',
      full: 'عَنِ النَّبَاِ الْعَظِيْمِۙ',
    },
    3: {
      helper: 'الَّذِيْ',
      full: 'الَّذِيْ هُمْ فِيْهِ مُخْتَلِفُوْنَۗ',
    },
    4: {
      helper: 'كَلَّ',
      full: 'كَلَّا سَيَعْلَمُوْنَۙ',
    },
    5: {
      helper: 'ثُمَّ كَلَّ',
      full: 'ثُمَّ كَلَّا سَيَعْلَمُوْنَ',
    },
    6: {
      helper: 'اَلَمْ',
      full: 'اَلَمْ نَجْعَلِ الْاَرْضَ مِهٰدًاۙ',
    },
    7: {
      helper: 'وَّالْجِبَالَ',
      full: 'وَّالْجِبَالَ اَوْتَادًاۖ',
    },
    8: {
      helper: 'وَّخَلَقْنٰكُمْ',
      full: 'وَّخَلَقْنٰكُمْ اَزْوَاجًاۙ',
    },
    9: {
      helper: 'وَّجَعَلْنَا',
      full: 'وَّجَعَلْنَا نَوْمَكُمْ سُبَاتًاۙ',
    },
    // 10: {
    //   full: 'وَّجَعَلْنَا الَّيْلَ لِبَاسًاۙ',
    // },
    // 11: {
    //   full: 'وَّجَعَلْنَا النَّهَارَ مَعَاشًاۚ',
    // },
    // 12: {
    //   full: 'وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًاۙ',
    // },
    // 13: {
    //   full: 'وَّجَعَلْنَا سِرَاجًا وَّهَّاجًاۖ',
    // },
    // 14: {
    //   full: 'وَّاَنْزَلْنَا مِنَ الْمُعْصِرٰتِ مَاۤءً ثَجَّاجًاۙ',
    // },
    // 15: {
    //   full: 'لِّنُخْرِجَ بِهٖ حَبًّا وَّنَبَاتًاۙ',
    // },
    // 16: {
    //   full: 'وَّجَنّٰتٍ اَلْفَافًاۗ',
    // },
    // 17: {
    //   full: 'اِنَّ يَوْمَ الْفَصْلِ كَانَ مِيْقَاتًاۙ',
    // },
    // 18: {
    //   full: 'يَّوْمَ يُنْفَخُ فِى الصُّوْرِ فَتَأْتُوْنَ اَفْوَاجًاۙ',
    // },
    // 19: {
    //   full: 'وَّفُتِحَتِ السَّمَاۤءُ فَكَانَتْ اَبْوَابًاۙ',
    // },
    // 20: {
    //   full: 'وَّسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًاۗ',
    // },
    // 21: {
    //   full: 'اِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًاۙ',
    // },
    // 22: {
    //   full: 'لِّلطّٰغِيْنَ مَاٰبًاۙ',
    // },
    // 23: {
    //   full: 'لّٰبِثِيْنَ فِيْهَآ اَحْقَابًاۚ',
    // },
    // 24: {
    //   full: 'لَا يَذُوْقُوْنَ فِيْهَا بَرْدًا وَّلَا شَرَابًاۙ',
    // },
    // 25: {
    //   full: 'اِلَّا حَمِيْمًا وَّغَسَّاقًاۙ',
    // },
    // 26: {
    //   full: 'جَزَاۤءً وِّفَاقًاۗ',
    // },
    // 27: {
    //   full: 'اِنَّهُمْ كَانُوْا لَا يَرْجُوْنَ حِسَابًاۙ',
    // },
    // 28: {
    //   full: 'وَّكَذَّبُوْا بِاٰيٰتِنَا كِذَّابًاۗ',
    // },
    // 29: {
    //   full: 'وَكُلَّ شَيْءٍ اَحْصَيْنٰهُ كِتٰبًاۙ',
    // },
    // 30: {
    //   full: 'فَذُوْقُوْا فَلَنْ نَّزِيْدَكُمْ اِلَّا عَذَابًا',
    // },
    // 31: {
    //   full: 'اِنَّ لِلْمُتَّقِيْنَ مَفَازًاۙ',
    // },
    // 32: {
    //   full: 'حَدَاۤىِٕقَ وَاَعْنَابًاۙ',
    // },
    // 33: {
    //   full: 'وَّكَوَاعِبَ اَتْرَابًاۙ',
    // },
    // 34: {
    //   full: 'وَّكَأْسًا دِهَاقًاۗ',
    // },
    // 35: {
    //   full: 'لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا وَّلَا كِذَّابًا',
    // },
    // 36: {
    //   full: 'جَزَاۤءً مِّنْ رَّبِّكَ عَطَاۤءً حِسَابًاۙ',
    // },
    // 37: {
    //   full:
    //     'رَّبِّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا الرَّحْمٰنِ لَا يَمْلِكُوْنَ مِنْهُ خِطَابًاۚ',
    // },
    // 38: {
    //   full:
    //     'يَوْمَ يَقُوْمُ الرُّوْحُ وَالْمَلٰۤىِٕكَةُ صَفًّاۙ لَّا يَتَكَلَّمُوْنَ اِلَّا مَنْ اَذِنَ لَهُ الرَّحْمٰنُ وَقَالَ صَوَابًا',
    // },
    // 39: {
    //   full:
    //     'ذٰلِكَ الْيَوْمُ الْحَقُّۚ فَمَنْ شَاۤءَ اتَّخَذَ اِلٰى رَبِّهٖ مَاٰبًا',
    // },
    // 40: {
    //   full:
    //     'اِنَّآ اَنْذَرْنٰكُمْ عَذَابًا قَرِيْبًا ەۙ يَّوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُوْلُ الْكٰفِرُ يٰلَيْتَنِيْ كُنْتُ تُرَابًا',
    // },
  },
};

export default data;
